<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download YubiSwitch for macOS and import it to Munki</string>
    <key>Identifier</key>
    <string>com.github.ronniejones.munki.yubiswitch</string>
    <key>ParentRecipe</key>
    <string>com.github.ronniejones.download.yubiswitch</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>yubiswitch</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Angelo Failla</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>IT-Support</string>
            </array>
            <key>description</key>
            <string>Yubiswitch is an macOS status bar application to enable/disable a Yubikey Nano or Neo from Yubico.</string>
            <key>display_name</key>
            <string>YubiSwitch</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
