<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.creditkarma.autopkg-recipes.jamf.jamfStatus</string>
	<key>Input</key>
	<dict>
		<key>ARCHITECTURE</key>
		<string>arm64</string>
		<key>CATEGORY</key>
		<string>Design</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroup-update-smart.xml</string>
		<key>INSTALL_BUTTON_TEXT</key>
		<string>Install</string>
		<key>NAME</key>
		<string>JamfStatus</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>POLICY_RUN_COMMAND</key>
		<string> </string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>REINSTALL_BUTTON_TEXT</key>
		<string>Install</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Keep an eye on the status of Jamf Cloud with jamfStatus. The app will place an icon in the menu bar to reflect the current cloud status.</string>
		<key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%SOFTWARE_TITLE%.png</string>
		<key>SOFTWARE_TITLE</key>
		<string>%NAME%</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.creditkarma.autopkg-recipes.pkg.jamfStatus</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%pkg_path%</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%ARCHITECTURE%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%ARCHITECTURE%-%version%.pkg</string>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
			<key>computergroup_name</key>
			<string>%GROUP_NAME%</string>
			<key>computergroup_template</key>
			<string>%GROUP_TEMPLATE%</string>
			<key>replace_group</key>
			<string>True</string>
		</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
