<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Developer from the Mac App Store and creates a package.</string>
	<key>Identifier</key>
	<string>com.clienteng.creditkarma.pkg.Developer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Developer</string>
		<key>PATH</key>
		<string>/Applications/Developer.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.nmcspadden.pkg.appstore</string>
	<key>Process</key>
	<array/>
</dict>
</plist>
