<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads both Arm and Intel verions of the Figma App</string>
	<key>Identifier</key>
	<string>com.creditkarma.autopkg-recipes.download.Figma-Universal</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Figma</string>
		<key>URL_ARM64</key>
		<string>https://desktop.figma.com/mac-arm/Figma.zip</string>
		<key>URL_X86_64</key>
		<string>https://desktop.figma.com/mac/Figma.zip</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>download_dir</key>
				<string>%RECIPE_CACHE_DIR%/downloads</string>
				<key>filename</key>
				<string>%NAME%-arm64.zip</string>
				<key>url</key>
				<string>%URL_ARM64%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>download_dir</key>
				<string>%RECIPE_CACHE_DIR%/downloads</string>
				<key>filename</key>
				<string>%NAME%-x86_64.zip</string>
				<key>url</key>
				<string>%URL_X86_64%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-arm64.zip</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/arm64</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-x86_64.zip</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/x86_64</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>deep_verification</key>
				<true/>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/arm64/Figma.app</string>
				<key>requirement</key>
				<string>identifier "com.figma.Desktop" and anchor apple generic and certificate
1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13]
/* exists */ and certificate leaf[subject.OU] = T8RA8NE3B7
</string>
				<key>strict_verification</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>deep_verification</key>
				<true/>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/x86_64/Figma.app</string>
				<key>requirement</key>
				<string>identifier "com.figma.Desktop" and anchor apple generic and certificate
1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13]
/* exists */ and certificate leaf[subject.OU] = T8RA8NE3B7
</string>
				<key>strict_verification</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/arm64/Figma.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
