---
Description: Downloads both Arm and Intel verions of the Figma App
Identifier: com.creditkarma.autopkg-recipes.download.Figma-Universal
MinimumVersion: '2.3'

Input:
  NAME: Figma
  URL_ARM64: https://desktop.figma.com/mac-arm/Figma.zip
  URL_X86_64: https://desktop.figma.com/mac/Figma.zip

Process:
  - Processor: URLDownloader
    Arguments:
      filename: '%NAME%-arm64.zip'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%URL_ARM64%'

  - Processor: URLDownloader
    Arguments:
      filename: '%NAME%-x86_64.zip'
      download_dir: '%RECIPE_CACHE_DIR%/downloads'
      url: '%URL_X86_64%'

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%-arm64.zip'
      destination_path: '%RECIPE_CACHE_DIR%/unpack/arm64'
      purge_destination: true

  - Processor: Unarchiver
    Arguments:
      archive_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%-x86_64.zip'
      destination_path: '%RECIPE_CACHE_DIR%/unpack/x86_64'
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/arm64/Figma.app'
      requirement: |
        identifier "com.figma.Desktop" and anchor apple generic and certificate
        1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13]
        /* exists */ and certificate leaf[subject.OU] = T8RA8NE3B7
      deep_verification: true
      strict_verification: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unpack/x86_64/Figma.app'
      requirement: |
        identifier "com.figma.Desktop" and anchor apple generic and certificate
        1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13]
        /* exists */ and certificate leaf[subject.OU] = T8RA8NE3B7
      deep_verification: true
      strict_verification: true

  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/unpack/arm64/Figma.app/Contents/Info.plist'
      plist_version_key: CFBundleShortVersionString
