<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Splunk Universal Forwarder.</string>
    <key>Identifier</key>
    <string>com.github.ronniejones.download.SplunkForwarder</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SplunkForwarder</string>
	</dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.splunk.com/en_us/download/universal-forwarder.html</string>
                <key>re_pattern</key>
                <string>data-link=\"(?P&lt;url&gt;https://.*?/products/universalforwarder/releases/(?P&lt;version&gt;[0-9\.]+)/osx/splunkforwarder-[0-9\.]+-[0-9a-f]+-darwin-64.tgz)\"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.tgz</string>
	        </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
