<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Downloads the latest version of Keka, makes a pkg of it</string>
	<key>Description</key>
	<string>Downloads the latest version of Keka, makes a pkg of it.</string>
	<key>Identifier</key>
	<string>com.github.ronniejones.pkg.IDEA-IU</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.ronniejones.IDEA-IU</string>
		<key>NAME</key>
		<string>IDEA-IU</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ronniejones.download.IDEA-IU</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
