<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release of Crypt client scripts from Github and imports into Munki.
        </string>
        <key>Identifier</key>
        <string>com.github.ronniejones.Crypt.munki</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/Crypt</string>
            <key>NAME</key>
            <string>Crypt</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>Crypt is a Filevault 2 Escrow solution.</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.5.0</string>
        <key>ParentRecipe</key>
        <string>com.github.ronniejones.Crypt.download</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>flat_pkg_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/Payload</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                </dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>faux_root</key>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                    <key>installs_item_paths</key>
                    <array>
                        <string>/Library/LaunchDaemons/com.grahamgilbert.crypt.needsescrow.plist</string>
                        <string>/usr/local/crypt/delayed_escrow</string>
                        <string>/usr/local/crypt/Crypt.app</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>MunkiInstallsItemsCreator</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/unpack</string>
                        <string>%RECIPE_CACHE_DIR%/payload</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
