<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Anaconda for Python 3 and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.ygini.munki.anaconda3</string>
	<key>Input</key>
	<dict>
		<key>INSTALLER_TYPE</key>
		<string>pkg</string>
        <key>PYTHON_MAJOR_VERSION</key>
        <string>3</string>
		<key>MUNKI_CATALOGS</key>
		<string>testing</string>
		<key>MUNKI_CATEGORY</key>
		<string>Science</string>
		<key>MUNKI_DEVELOPER</key>
		<string>Continuum</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/anaconda/python%PYTHON_MAJOR_VERSION%/</string>
		<key>NAME</key>
		<string>Anaconda%PYTHON_MAJOR_VERSION%</string>
		<key>DISPLAY_NAME</key>
		<string>Anaconda for Python %PYTHON_MAJOR_VERSION%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>%MUNKI_CATALOGS%</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Anaconda is the leading open data science platform powered by Python. The open source version of Anaconda is a high performance distribution of Python and R and includes over 100 of the most popular Python, R and Scala packages for data science.</string>
			<key>developer</key>
			<string>%MUNKI_DEVELOPER%</string>
			<key>display_name</key>
			<string>%DISPLAY_NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>uninstall_method</key>
			<string>removepackages</string>
			<key>uninstallable</key>
			<true/>
			<key>requires</key>
			<array>
				<string>Python3</string>
			</array>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.ronniejones.download.Anaconda</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>