<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Hopper Disassembler v4.</string>
	<key>Identifier</key>
	<string>com.clienteng.creditkarma.download.HopperDisassemblerv4</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>HopperDisassembler4</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>https://www.hopperapp.com/HopperWeb/appcast_v4.php</string>
                <key>appcast_query_pairs</key>
                <dict>
                    <key>Demo</key>
                    <string>false</string>
                </dict>
                <key>appcast_request_headers</key>
                <dict>
                    <key>User-Agent</key>
                    <string>Hopper Disassembler</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>

